---
kind: property
id: P:Autodesk.Revit.DB.BeamSystem.LayoutRule
source: html/2db288d4-8e26-b710-6371-72c8054a3d8b.htm
---
# Autodesk.Revit.DB.BeamSystem.LayoutRule Property

Retrieves or changes the LayoutRule of the BeamSystem.

## Syntax (C#)
```csharp
public LayoutRule LayoutRule { get; set; }
```